stockoverflow/app/views/photos/index.html.erb

SELECT tags.*, taggings.tags_count AS count FROM "tags" JOIN (SELECT taggings.tag_id, COUNT(taggings.tag_id) AS tags_count FROM "taggings" INNER JOIN photos ON photos.id = taggings.taggable_id WHERE (taggings.taggable_type = 'Photo' AND taggings.context = 'tags') AND (taggings.taggable_id IN(SELECT photos.id FROM "photos" )) GROUP BY taggings.tag_id HAVING COUNT(taggings.tag_id) > 0) AS taggings ON taggings.tag_id = tags.id
---
    <td><%= photo.description %></td>
    <td><%= raw photo.tag_list.map { |t| link_to t, tag_path(t) }.join(', ')  %></td>