stockoverflow/app/views/photos/show.html.erb

SELECT answers.*, SUM(CASE votes.vote WHEN 't' THEN 1 WHEN 'f' THEN -1 ELSE 0 END) AS plusminus_tally, COUNT(votes.id) AS vote_count FROM "answers" LEFT OUTER JOIN votes ON answers.id = votes.voteable_id AND votes.voteable_type = 'Answer' WHERE "answers"."photo_id" = 3 GROUP BY answers.id, answers.content, answers.user_id, answers.vote, answers.photo_id, answers.flag, answers.created_at, answers.updated_at ORDER BY plusminus_tally DESC
---
<h3>Answers: </h3>
<% @photo.answers.each do |answer| %>