stockoverflow/app/controllers/answers_controller.rb

  def show
    @answer = Answer.find(params[:id])
---
SELECT "answers".* FROM "answers" WHERE "answers"."id" = $1 LIMIT 1  [["id", "1"]]

  def edit
    @answer = Answer.find(params[:id])
---
SELECT "answers".* FROM "answers" WHERE "answers"."id" = $1 LIMIT 1  [["id", "10"]]

  def create
    @answer = Answer.new(params[:answer])
    @photo = Photo.find(params[:answer][:photo_id])

    respond_to do |format|
      if @answer.save
---
SELECT "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT 1  [["id", "3"]]
INSERT INTO "answers" ("content", "created_at", "flag", "photo_id", "updated_at", "user_id", "vote") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["content", "blaa"], ["created_at", Mon, 24 Feb 2014 18:12:04 UTC +00:00], ["flag", nil], ["photo_id", 3], ["updated_at", Mon, 24 Feb 2014 18:12:04 UTC +00:00], ["user_id", 5], ["vote", nil]]

  def vote_up
    @answer = Answer.find(params[:id])
---
SELECT "answers".* FROM "answers" WHERE "answers"."id" = $1 LIMIT 1  [["id", "2"]]

  def vote_down
    @answer = Answer.find(params[:id])
---
SELECT "answers".* FROM "answers" WHERE "answers"."id" = $1 LIMIT 1  [["id", "2"]]

  def remove_vote
    @answer = Answer.find(params[:id])
---
SELECT "answers".* FROM "answers" WHERE "answers"."id" = $1 LIMIT 1  [["id", "2"]]

  def destroy
    @answer = Answer.find(params[:id])
    @answer.destroy
---
SELECT "answers".* FROM "answers" WHERE "answers"."id" = $1 LIMIT 1  [["id", "1"]]
DELETE FROM "answers" WHERE "answers"."id" = $1  [["id", 1]]