stockoverflow/app/controllers/photos_controller.rb

SELECT "photos".* FROM "photos" JOIN taggings photos_taggings_a213908 ON photos_taggings_a213908.taggable_id = "photos".id AND photos_taggings_a213908.taggable_type = 'Photo' AND photos_taggings_a213908.tag_id = 1
SELECT COUNT(*) FROM "photos"
SELECT tags.*, taggings.tags_count AS count FROM "tags" JOIN (SELECT taggings.tag_id, COUNT(taggings.tag_id) AS tags_count FROM "taggings" INNER JOIN photos ON photos.id = taggings.taggable_id WHERE (taggings.taggable_type = 'Photo' AND taggings.context = 'tags') AND (taggings.taggable_id IN(SELECT photos.id FROM "photos" )) GROUP BY taggings.tag_id HAVING COUNT(taggings.tag_id) > 0) AS taggings ON taggings.tag_id = tags.id
---
  def index

      if params[:search]
        @photos = Photo.plusminus_tally.where('title ILIKE ? OR description ILIKE ?', "%#{params[:search]}%", "%#{params[:search]}%").paginate(:page => params[:page], :per_page => 10)
      elsif params[:tag]
        @photos = Photo.plusminus_tally.tagged_with(params[:tag]).paginate(:page => params[:page], :per_page => 10)

SELECT "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT answers.*, SUM(CASE votes.vote WHEN 't' THEN 1 WHEN 'f' THEN -1 ELSE 0 END) AS plusminus_tally, COUNT(votes.id) AS vote_count FROM "answers" LEFT OUTER JOIN votes ON answers.id = votes.voteable_id AND votes.voteable_type = 'Answer' WHERE "answers"."photo_id" = 3 GROUP BY answers.id, answers.content, answers.user_id, answers.vote, answers.photo_id, answers.flag, answers.created_at, answers.updated_at ORDER BY plusminus_tally DESC
---
  def show
    @photo = Photo.find(params[:id])
    @answer = Answer.new(photo_id: params[:id], user_id: current_user.id) if current_user
    @answers = @photo.answers.plusminus_tally.order('plusminus_tally DESC')

INSERT INTO "photos" ("album_id", "created_at", "description", "flag", "image", "question", "rating", "title", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @photo = Photo.new(params[:photo])
    @photo.user = current_user
    respond_to do |format|
      if @photo.save

SELECT "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def vote_up
    @photo = Photo.find(params[:id])

SELECT "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT 1  [["id", "2"]]
---
  def vote_down
    @photo = Photo.find(params[:id])

SELECT "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT 1  [["id", "2"]]
---
  def remove_vote
    @photo = Photo.find(params[:id])